results/routeA/initialization_check/A-H-Ra1e6-fine-beta1e-4/0/gh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      gh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-0.4401408450704226
-0.4401408450704227
-0.4401408450704227
-0.4401408450704226
-0.4401408450704225
-0.4401408450704227
-0.4401408450704228
-0.4401408450704226
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.4401408450704227
-1.320422535211268
-2.200704225352112
-3.080985915492958
-3.961267605633804
-4.841549295774649
-5.721830985915494
-6.60211267605634
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.4401408450704227
-1.320422535211268
-2.200704225352112
-3.080985915492958
-3.961267605633803
-4.841549295774649
-5.721830985915492
-6.602112676056338
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-140.8450704225352
-140.8450704225352
-140.8450704225352
-140.8450704225352
-140.8450704225352
-140.8450704225352
-140.8450704225352
-140.8450704225352
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
