results/routeA/initialization_check/A-H-Ra1e6-fine-beta1e-4/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
25600
(
-0.4401408450704226
-0.4401408450704226
-0.4401408450704226
-0.4401408450704226
-0.4401408450704226
-0.4401408450704226
-0.4401408450704226
-0.4401408450704226
...
)
;

boundaryField
{
    hotWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.440118838028169
-1.320356514084507
-2.200594190140845
-3.080831866197183
-3.961069542253521
-4.84130721830986
-5.721544894366197
-6.601782570422535
...
)
;
    }
    coldWall
    {
        type            calculated;
        value           nonuniform List<scalar> 
160
(
-0.4401628521126761
-1.320488556338028
-2.20081426056338
-3.081139964788732
-3.961465669014085
-4.841791373239436
-5.722117077464788
-6.602442781690141
...
)
;
    }
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform -140.8450704225352;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
