results/routeA/initialization_check/A-H-Ra1e6-fine-beta1e-4/constant/g
FoamFile
{
    format ascii;
    class uniformDimensionedVectorField;
    location "constant";
    object g;
}
dimensions [0 1 -2 0 0 0 0];
value (0 -1408.4507042253521 0);
