results/routeA/initialization_check/A-H-Ra1e6-fine-beta1e-4/constant/hRef
FoamFile
{
    format ascii;
    class uniformDimensionedScalarField;
    location "constant";
    object hRef;
}
dimensions [0 1 0 0 0 0 0];
value 0;
