results/routeA/initialization_check/A-H-Ra1e6-fine-beta1e-4/constant/thermophysicalTransport
FoamFile
{
    format ascii;
    class dictionary;
    location "constant";
    object thermophysicalTransport;
}
laminar
{
    model Fourier;
}
